In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Rent Data (1).csv')

In [3]:
df2 = pd.read_csv('supershops.csv')

In [4]:
df.head()

   area   rent
0  2000  31500
1  2100  35000
2  2500  41050
3  2250  36100
4  3000  52100

In [5]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Normalization___MinMaxScaler()

In [6]:
from sklearn.preprocessing import MinMaxScaler

In [7]:
scaler = MinMaxScaler()
#scaler = MinMaxScaler(feature_range=(4,5))

In [8]:
scaler

MinMaxScaler()

In [9]:
Scaled_1 = scaler.fit(df2[['Marketing Spend']])

In [10]:
Scaled_1

MinMaxScaler()

In [11]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [12]:
df2['Marketing Spend'] = scaler.transform(df2[['Marketing Spend']])

In [13]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [14]:
df2['Administration'] = scaler.fit_transform(df2[['Administration']])

In [15]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [16]:
df2['Transport'] = scaler.fit_transform(df2[['Transport']])

In [17]:
df2['Profit'] = scaler.fit_transform(df2[['Profit']])

In [18]:
df2.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.651744   1.000000    Dhaka  1.000000
1         0.983359        0.761972   0.940893      Ctg  0.997355
2         0.927985        0.379579   0.864664  Rangpur  0.993178
3         0.873136        0.512998   0.812235    Dhaka  0.947292
4         0.859438        0.305328   0.776136  Rangpur  0.853171

# StandardScaler

In [19]:
from sklearn.preprocessing import StandardScaler

In [20]:
df3 = pd.read_csv('supershops.csv')

In [21]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [22]:
Standard_Scaler = StandardScaler()

In [23]:
scaled3 = Standard_Scaler.fit(df3[['Marketing Spend']])

In [24]:
df3['Marketing Spend'] = Standard_Scaler.transform(df3[['Marketing Spend']])

In [25]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913       136897.80  471784.10    Dhaka  192261.83
1         1.955860       151377.59  443898.53      Ctg  191792.06
2         1.754364       101145.55  407934.54  Rangpur  191050.39
3         1.554784       118671.85  383199.62    Dhaka  182901.99
4         1.504937        91391.77  366168.42  Rangpur  166187.94

In [26]:
df3['Administration']= Standard_Scaler.fit_transform(df3[['Administration']])

In [27]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

In [28]:
df3['Transport']= Standard_Scaler.fit_transform(df3[['Transport']])

In [29]:
df3['Profit']= Standard_Scaler.fit_transform(df3[['Profit']])

In [30]:
df3.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.897913        0.560753   2.165287    Dhaka  2.011203
1         1.955860        1.082807   1.929843      Ctg  1.999430
2         1.754364       -0.728257   1.626191  Rangpur  1.980842
3         1.554784       -0.096365   1.417348    Dhaka  1.776627
4         1.504937       -1.079919   1.273550  Rangpur  1.357740

# MaxAbsScaler

In [34]:
from sklearn.preprocessing import MaxAbsScaler

In [35]:
Max_Abs_Scaler = MaxAbsScaler()

In [36]:
df3['Marketing Spend']=Max_Abs_Scaler.fit_transform(df3[['Marketing Spend']])

In [37]:
df3['Administration']=Max_Abs_Scaler.fit_transform(df3[['Administration']])

In [40]:
df3['Transport']=Max_Abs_Scaler.fit_transform(df3[['Transport']])

In [41]:
df3['Profit']=Max_Abs_Scaler.fit_transform(df3[['Profit']])

In [42]:
df3.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.445303        0.221993   1.000000    Dhaka  0.824496
1         0.969971        0.428666   0.891264      Ctg  0.819669
2         0.870043       -0.288305   0.751028  Rangpur  0.812049
3         0.771065       -0.038149   0.654577    Dhaka  0.728331
4         0.746344       -0.427523   0.588166  Rangpur  0.556608

# Robust Scaler

In [46]:
from sklearn.preprocessing import RobustScaler

In [47]:
Robust_Scaler = RobustScaler()

In [48]:
df3['Marketing Spend'] = Robust_Scaler.fit_transform(df3[['Marketing Spend']])

In [49]:
df3['Administration'] = Robust_Scaler.fit_transform(df3[['Administration']])

In [50]:
df3['Transport'] = Robust_Scaler.fit_transform(df3[['Transport']])

In [51]:
df3['Profit'] = Robust_Scaler.fit_transform(df3[['Profit']])

In [52]:
df3.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.672530        0.345355   1.552016    Dhaka  1.698340
1         1.452113        0.697565   1.383714      Ctg  1.688874
2         1.303634       -0.524290   1.166654  Rangpur  1.673929
3         1.156567       -0.097977   1.017368    Dhaka  1.509736
4         1.119836       -0.761543   0.914576  Rangpur  1.172943